# TryingToAttachWhenJoined Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..TryingToAttachWhenJoined Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The column and target are joined. The attachment has been removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TryingToAttachWhenJoined { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TryingToAttachWhenJoined As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TryingToAttachWhenJoined {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace